[{"text": "# MANAPPURAM FINANCELIMITED \n\nTo,\n\n| BSE Limited |\n| :-- |\n| Phiroze Jeejeebhoy Towers |\n| Dalal Street |\n| Mumbai- 400001 |\n| Scrip Code: 531213 |\n\nNational Stock Exchange of India Limited<br>5th Floor, Exchange Plaza<br>Bandra (East)<br>Mumbai - 400051<br>Scrip Code: MANAPPURAM\n\nDear Sir/Madam,\nSub: Intimation - Business Responsibility and Sustainability Report (\"BRSR\") for the Financial Year 2023-24.\n\nIn terms of Regulation 34 of SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we are enclosing herewith the Business Responsibility and Sustainability Report (\"BRSR\") for the Financial Year 2023-24. Kindly note that the said BRSR also forms part of the Integrated Annual Report of the Company for the Financial Year 2023-24.\n\nThe above information is also available on the website of the Company at\nhttps://www.manappuram.com/index.php/annual-reports\n\nKindly take the same on your record.\nThanking you.\n\nYours Faithfully,\nFor Manappuram Finance Limited\nMANOJK\nUMAR V\nR\n![img-0.jpeg](img-0.jpeg)\n\nManoj Kumar V.R\nCompany Secretary", "metadata": {"source": "streamlit_temp_MANAPPURAM_22072024190041_BRSRBSE.pdf", "page": 0, "chunk_index": 0}}, {"text": "# Business Responsibility and Sustainability Report \n\n## SECTION A: GENERAL DISCLOSURES\n\nI. Details of the listed entity\n\n| 1 | Corporate Identity Number (CIN) of the Listed Entity | L65910KL1992PLC006623 |\n| :--: | :--: | :--: |\n| 2 | Name of the Listed Entity | Manappuram Finance Limited |\n| 3 | Year of incorporation | 1992 |\n| 4 | Registered office address | W-4/638A, Manappuram House, Valapad - 680567, Thrissur, Kerala |\n| 5 | Corporate address | Corporate Office: W-4/638A, Manappuram House Valapad, Thrissur,Kerala - 680567Landline: 04873050000,3050108, 3050100 <br> Corporate office Annexe: A-Wing, $3^{\\text {rd }}$ Floor, Unit No 301 To 315 Kanakia Wall, Street, Andheri Kurla Road, Andheri East, Mumbai, Maharashtra -400093 Landline: 02268194000 |\n| 6 | E-mail | mail@manappuram.com |\n| 7 | Telephone | 04873050000 |\n| 8 | Website | www.manappuram.com |\n| 9 | Financial year for which reporting is being done | 2023-2024 |\n| 10 | Name of the Stock Exchange(s) where shares are listed | BSE Limited and National Stock Exchange of India Limited |\n| 11 | Paid-up Capital | \\ 169.29 Crores |\n| 12 | Name and contact details (telephone, email address) of the person who may be contacted in case of any queries on the BRSR report | Manoj Kumar V R Company secretary \\& Compliance Officer Contact - 0487-3050408 Email - cs@manappuram.com |\n| 13 | Reporting boundary - Are the disclosures under this report made on a standalone basis (i.e. only for the entity) or on a consolidated basis (i.e. for the entity and all the entities which form a part of its consolidated financial statements, taken together). | The disclosures are made on a standalone basis. |\n| 14 | Name of assurance provider | Not Applicable |\n| 15 | Type of assurance obtained | Not Applicable |\n\n## II Products/services\n\n16. Details of business activities (accounting for $90 \\%$ of the turnover):\n\n| S.No. | Description of Main Activity | Description of Business Activity | \\% of Turnover of the entity |\n| :--: | :--: | :--: | :--: |\n| 1 | Financial services | Manappuram Finance Limited is a retail financial services provider and engages in activities such as providing Loans against gold jewellery, Loans against property, Loans for purchase of commercial vehicles, Loans to MSMEs and other complementary lending activities. | $9771 \\%$ |\n\n17. Products/Services sold by the entity (accounting for $90 \\%$ of the entityu Turnover):\nS.No. Product/Service\nNIC Code\n\\% of total Turnover contributed\n1 Financial services\n64990\n$97.71 \\%$\n\n## III. Operations\n\n18. Number of locations where plants and/or operations/offices of the entity are situated\n\n| Location | Number of plants | Number of offices | Total |\n| :-- | :--: | :--: | :--: |\n| National | 0 | 3524 | 3524 |\n| International | 0 | 0 | 0 |", "metadata": {"source": "streamlit_temp_MANAPPURAM_22072024190041_BRSRBSE.pdf", "page": 1, "chunk_index": 0}}, {"text": "19. Markets served by the entity:\na. Number of locations\n\n| Locations | Number |\n| :-- | --: |\n| National (No. of States) | 28 |\n| International (No. of Countries) | 0 |\n\nNote: Manappuram Finance Limited has offices in 22 States and 6 Union Territories across India.\nb. What is the contribution of exports as a percentage of the total turnover of the entity?\n$0 \\%$\nc. A brief on types of customers\n\nManappuram Finance Limited caters to the following types of customers:\n\n1. Individuals: These type of customers include salaried employees, self-employed professionals, and individuals holding gold jewellery, seeking quick and convenient financing options for personal and family needs.\n2. Businesses and Corporates: This segment comprises of small to medium-sized enterprises (SMEs), large corporate entities, service institutions in educational and healthcare sectors to meet their working capital and term loans\n3. Micro and Small-Scale Enterprises (MSME): This group comprises micro and small enterprises for trading and manufacturing activities.\n\nBy understanding and categorising its customers into these segments, Manappuram Finance Limited can effectively tailor its financial products and services to meet the diverse needs of its customer base, fostering financial inclusion and supporting economic growth across various sectors.\n\n# IV. Employees \n\n20. Details as at the end of Financial Year:\na. Employees and workers (including differently abled):\n\n| S. Particulars | Total (A) | Male |  | Female |  |\n| :--: | :--: | :--: | :--: | :--: | :--: |\n| No. |  | No.(B) | \\%(B/A) | No. (C) | \\%(C/A) |\n| EMPLOYEES |  |  |  |  |  |\n| 1 | Permanent (D) | 22470 | 16149 | 71.87\\% | 6321 | 28.13\\% |\n| 2 | Other than Permanent (E) | 7250 | 6730 | 92.83\\% | 520 | 7.17\\% |\n| 3 | Total employees (D + E) | 29720 | 22879 | 76.98\\% | 6841 | 23.02\\% |\n| WORKERS |  |  |  |  |  |\n| 4 | Permanent (F) | 0 | 0 | $0 \\%$ | 0 | $0 \\%$ |\n| 5 | Other than Permanent (G) | 0 | 0 | $0 \\%$ | 0 | $0 \\%$ |\n| 6 | Total workers (F + G) | 0 | 0 | $0 \\%$ | 0 | $0 \\%$ |\n\nb. Differently abled Employees and workers:\n\n| S. Particulars | Total (A) | Male |  | Female |  |\n| :--: | :--: | :--: | :--: | :--: | :--: |\n| No. |  | No.(B) | \\%(B/A) | No. (C) | \\%(C/A) |\n| DIFFERENTLY ABLED EMPLOYEES |  |  |  |  |  |\n| 1 | Permanent (D) | 0 | 0 | $0 \\%$ | 0 | $0 \\%$ |\n| 2 | Other than Permanent (E) | 0 | 0 | $0 \\%$ | 0 | $0 \\%$ |\n| 3 | Total differently abled employees (D + E) | 0 | 0 | $0 \\%$ | 0 | $0 \\%$ |\n| DIFFERENTLY ABLED WORKERS |  |  |  |  |  |\n| 4 | Permanent (F) | 0 | 0 | $0 \\%$ | 0 | $0 \\%$ |\n| 5 | Other than Permanent (G) | 0 | 0 | $0 \\%$ | 0 | $0 \\%$ |\n| 6 | Total differently abled workers (F + G) | 0 | 0 | $0 \\%$ | 0 | $0 \\%$ |", "metadata": {"source": "streamlit_temp_MANAPPURAM_22072024190041_BRSRBSE.pdf", "page": 2, "chunk_index": 0}}, {"text": "21. Participation/Inclusion/Representation of women\n\n|  | Total (A) | No. and percentage of Females |  |\n| :-- | :--: | :--: | :--: |\n|  |  | No. (B) | $\\%(\\mathrm{~B} / \\mathrm{A})$ |\n| Board of Directors | 13 | 3 | $23.08 \\%$ |\n| Key Management Personnel | 4 | 2 | $50 \\%$ |\n\n22. Turnover rate for permanent employees and workers (Disclose trends for the past 3 years)\n\n|  | FY- 2024 <br> (Turnover rate in current FY) |  |  | FY- 2023 <br> (Turnover rate in previous FY) |  |  | FY- 2022 <br> (Turnover rate in the year prior to the previous FY) |  |  |\n| :--: | :--: | :--: | :--: | :--: | :--: | :--: | :--: | :--: | :--: |\n|  | Male | Female | Total | Male | Female | Total | Male | Female | Total |\n| Permanent Employees | 35.95\\% | 6.22\\% | 42.17\\% | 43.87\\% | 7.40\\% | 51.27\\% | 32.26\\% | 6.91\\% | 39.17\\% |\n| Permanent Workers | $0 \\%$ | $0 \\%$ | $0 \\%$ | $0 \\%$ | $0 \\%$ | $0 \\%$ | $0 \\%$ | $0 \\%$ | $0 \\%$ |\n\n# V. Holding, Subsidiary and Associate Companies (including joint ventures) \n\n23. Holding, Subsidiary and Associate Companies (including joint ventures)\n\n| S. <br> No. | Name of the holding / subsidiary / associate companies / joint ventures (A) |  | Indicate whether holding/ Subsidiary/ Associate/ Joint Venture |  | \\% of shares held by listed entity | Does the entity indicated at column A, participate in the Business Responsibility initiatives of the listed entity? (Yes/No) |  |\n| :--: | :--: | :--: | :--: | :--: | :--: | :--: | :--: |\n| 1 | Manappuram Home Finance Limited |  | Subsidiary |  | 100\\% | Yes |  |\n| 2 | Asirvad Micro Finance Limited |  | Subsidiary |  | 97.60\\% | Yes |  |\n| 3 | Manappuram Insurance Brokers Limited |  | Subsidiary |  | 100\\% | Yes |  |\n| 4 | Manappuram Comptech and Consultants Limited |  | Subsidiary |  | 99.81\\% | Yes |  |\n\n## VI. CSR Details\n\n24. (i) Whether CSR is applicable as per section 135 of Companies Act, 2013: (Yes/No) : Yes\n(ii) Turnover (in ₹) ₹ 5854.64 Crores\n(iii) Net worth (in ₹) ₹ 10349.26 Crores\n\n## VII. Transparency and Disclosures Compliances\n\n25. Complaints/Grievances on any of the principles (Principles 1 to 9) under the National Guidelines on Responsible Business Conduct:\n\n| Stakeholder group from whom complaint is received | Grievance Redressal Mechanism in Place (Yes/No) (If Yes, then provide web-link for grievance redress policy) | FY- 2024 <br> Current Financial Year |  |  | FY- 2023 <br> Previous Financial Year |  |  |\n| :--: | :--: | :--: | :--: | :--: | :--: | :--: | :--: |\n|  |  | Number of complaints filed during the year | Number of complaints pending resolution at close of the year | Remarks | Number of complaints filed during the year | Number of complaints pending resolution at close of the year | Remarks |\n| Communities | Yes | 0 | 0 |  | 0 | 0 |  |\n| Investors (other than shareholders) | Yes | 0 | 0 |  | 39 | 0 |  |\n| Shareholders | Yes | 0 | 0 |  | 0 | 0 |  |\n| Employees and workers | Yes | 2375 | 56 | Pending cases resolved in April month 2024 | 2113 | 223 | Pending cases resolved in April month 2023 |\n| Customers | Yes | 8047 | 55 | Pending cases resolved in April month 2024 | 6082 | 141 | Pending cases resolved in April month 2023 |\n| Value Chain Partners | Yes | 0 | 0 |  | 0 | 0 |  |\n| Other (please specify) | No | 0 | 0 |  | 0 | 0 |  |", "metadata": {"source": "streamlit_temp_MANAPPURAM_22072024190041_BRSRBSE.pdf", "page": 3, "chunk_index": 0}}, {"text": "![img-1.jpeg](img-1.jpeg)", "metadata": {"source": "streamlit_temp_MANAPPURAM_22072024190041_BRSRBSE.pdf", "page": 4, "chunk_index": 0}}, {"text": "![img-2.jpeg](img-2.jpeg)", "metadata": {"source": "streamlit_temp_MANAPPURAM_22072024190041_BRSRBSE.pdf", "page": 5, "chunk_index": 0}}, {"text": "![img-3.jpeg](img-3.jpeg)", "metadata": {"source": "streamlit_temp_MANAPPURAM_22072024190041_BRSRBSE.pdf", "page": 6, "chunk_index": 0}}, {"text": "![img-4.jpeg](img-4.jpeg)", "metadata": {"source": "streamlit_temp_MANAPPURAM_22072024190041_BRSRBSE.pdf", "page": 7, "chunk_index": 0}}, {"text": "![img-5.jpeg](img-5.jpeg)", "metadata": {"source": "streamlit_temp_MANAPPURAM_22072024190041_BRSRBSE.pdf", "page": 8, "chunk_index": 0}}, {"text": "# SECTION B: MANAGEMENT AND PROCESS DISCLOSURES \n\nThis section is aimed at helping businesses demonstrate the structures, policies and processes put in place towards adopting the NGRBC Principles and Core Elements.\n\n| Disclosure Questions |  | P1 | P2 | P3 | P4 | P5 | P6 | P7 | P8 | P9 |\n| :--: | :--: | :--: | :--: | :--: | :--: | :--: | :--: | :--: | :--: | :--: |\n| Policy And Management Processes |  |  |  |  |  |  |  |  |  |  |\n| 1. a. | Whether your entity's policy/policies cover each principle and its core elements of the NGRBCs. (Yes/No) |  |  |  |  | Yes |  |  |  |  |\n|  | b. Has the policy been approved by the Board? (Yes/No) |  |  |  |  | Yes |  |  |  |  |\n|  | c. Web Link of the Policies, if available |  |  |  |  | https://www.manappuram.com/policies-codes |  |  |  |  |\n| 2. | Whether the entity has translated the policy into procedures. (Yes / No) |  |  |  |  | Yes |  |  |  |  |\n| 3. | Do the enlisted policies extend to your value chain partners? (Yes/No) |  |  |  |  | No |  |  |  |  |\n| 4. | Name of the national and international codes/ certifications/labels/ standards (e.g. Forest Stewardship Council, Fairtrade, Rainforest Alliance, Trustea) standards (e.g. SA 8000, OHSAS, ISO, BIS) adopted by your entity and mapped to each principle. |  |  |  |  | Not Applicable |  |  |  |  |\n| 5. | Specific commitments, goals and targets set by the entity with defined timelines, if any. |  | In line with our unwavering commitment to sustainability, Manappuram Finance Limited has made significant progress in reducing our environmental and social impact. We have implemented solar electrification in our offices, advanced our transition to an electric vehicle fleet, and enhanced our sewage treatment. |  |  |  |  |  |  |\n|  |  |  | Socially, we have strengthened our skill development programs, community development efforts, quality education initiatives, and healthcare services through MAcare, ambulance services, and financial support to healthcare institutions. These commitments are crucial for a sustainable future and delivering long-term value to our stakeholders. |  |  |  |  |  |  |\n|  |  |  | We remain dedicated to improving our ESG practices and will continue to update on our progress. |  |  |  |  |  |  |\n| 6. | Performance of the entity against the specific commitments, goals and targets along-with reasons in case the same are not met. |  | This year, Manappuram Finance Limited has achieved significant milestones towards our specific commitments and targets. We are pleased to report an 18.65\\% increase in solar electricity production compared to FY 2022-23, underscoring our commitment to expand renewable energy usage. |  |  |  |  |  |  |\n|  |  |  | Additionally, our adoption of electric vehicles (EVs) has resulted in a reduction of 1923 KgCO2e emissions during the year. These accomplishments highlight our proactive approach towards sustainability and reducing our carbon footprint. While we have made substantial progress in these areas, we continue to explore opportunities for further enhancement and efficiency in achieving our environmental goals. |  |  |  |  |  |  |\n| Governance, leadership and oversight |  |  |  |  |  |  |  |  |  |\n| 7. | Statement by director responsible for the business responsibility report, highlighting ESG related challenges, targets and achievements (listed entity has flexibility regarding the placement of this disclosure) |  | As the Director responsible for Business Responsibility and Sustainability at Manappuram Finance Limited, I am pleased to reaffirm our unwavering commitment to sustainable banking practices, which generate positive social impacts. Sustainability is integral to our operations and long-term success. Since FY23, we have diligently published details of our ESG Responsibility and Sustainability Reporting in compliance with SEBI guidelines, showcasing our transparency and dedication. |  |  |  |  |  |  |", "metadata": {"source": "streamlit_temp_MANAPPURAM_22072024190041_BRSRBSE.pdf", "page": 9, "chunk_index": 0}}, {"text": "| Disclosure Questions | P1 | P2 | P3 | P4 | P5 | P6 | P7 | P8 | P9 |\n| :--: | :--: | :--: | :--: | :--: | :--: | :--: | :--: | :--: | :--: |\n|  | This year, we continued to drive significant climate initiatives, including the expansion of rainwater harvesting systems, the adoption of electric vehicles, and the installation of solar panels at our offices. These efforts underscore our commitment to reducing our environmental, footprint and promoting sustainable resource management. <br> On the social, front, our initiatives have made a substantial, difference in the communities we serve. We have enhanced skill,upgradation programs for our employees, supported community development projects, and provided quality education through innovative approaches. Our MAcare initiative has made advanced and affordable healthcare accessible, complemented by our ambulance service and financial support to healthcare institutions. <br> At Manappuram Finance, we are dedicated to continuously improving our ESG practices, reducing our environmental, impact, and aiding community development. These efforts are vital for creating a sustainable future and delivering long-term value to our stakeholders. |  |  |  |  |  |  |  |  |\n| 8. Details of the highest authority responsible for implementation and oversight of the Business Responsibility policy (ies). | The highest authority responsible for the implementation and oversight of the Business Responsibility policies at Manappuram Finance Limited is the Corporate Social Responsibility (CSR) Committee of the Board. This committee is entrusted with ensuring that the company's business responsibility initiatives align with its overarching goals and regulatory requirements. The CSR Committee oversees the formulation, execution, and monitoring of policies related to corporate social responsibility and sustainability, ensuring that these initiatives are integrated into the company's operations and corporate culture effectively. |  |  |  |  |  |  |  |\n| 9. Does the entity have a specified Committee of the Board/ Director responsible for decision making on sustainability related issues? (Yes / No). If yes, provide details. | Yes, The Corporate Social Responsibility (CSR) Committee is designated to oversee and guide the company's sustainability and CSR initiatives. |  |  |  |  |  |  |  |\n\n10: Details of Review of NGRBCs by the Company:\n\n| Subject for Review | Indicate whether review was undertaken by Director / Committee of the Board/ Any other Committee |  |  |  |  |  | Frequency (Annually/ Half yearly/ Quarterly/ Any other - please specify) |  |  |  |  |  |  |  |\n| :--: | :--: | :--: | :--: | :--: | :--: | :--: | :--: | :--: | :--: | :--: | :--: | :--: | :--: | :--: |\n| Performance against above policies and follow up action | Management and the Board |  |  |  |  |  | Quarterly |  |  |  |  |  |  |  |\n| Compliance with statutory requirements of relevance to the principles, and rectification of any non-compliances | Management and the Board |  |  |  |  |  | Quarterly |  |  |  |  |  |  |  |\n\n\n|  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |\n| :--: | :--: | :--: | :--: | :--: | :--: | :--: | :--: | :--: | :--: | :--: | :--: | :--: | :--: | :--: |\n| 11. | Has the entity carried out independent assessment/ evaluation of the working of its policies by an external agency? (Yes/No). If yes, provide name of the agency. |  |  |  |  |  |  |  |  |  |  |  |  |  |", "metadata": {"source": "streamlit_temp_MANAPPURAM_22072024190041_BRSRBSE.pdf", "page": 10, "chunk_index": 0}}, {"text": "# SECTION C: PRINCIPLE WISE PERFORMANCE DISCLOSURE \n\nThis section is aimed at helping entities demonstrate their performance in integrating the Principles and Core Elements with key processes and decisions. The information sought is categorized as \"Essential\" and \"Leadership\". While the essential indicators are expected to be disclosed by every entity that is mandated to file this report, the leadership indicators may be voluntarily disclosed by entities which aspire to progress to a higher level in their quest to be socially, environmentally and ethically responsible.\n\nPRINCIPLE 1 Businesses should conduct and govern themselves with integrity, and in a manner that is Ethical, Transparent and Accountable.\n\n## Essential Indicators\n\n1. Percentage coverage by training and awareness programmes on any of the Principles during the financial year:\n\n| Segment | Total number of training and awareness programmes held | Topics / principles covered under the training and its impact | \\% age of persons in respective category covered by the awareness programmes |\n| :--: | :--: | :--: | :--: |\n| Board of Directors | 1 | The board of directors receives training on ESG and the principles and disclosure requirements for the Business Responsibility and Sustainability Report. | $100 \\%$ |\n| Key Managerial Personnel | 35 | - Training on BRSR Requirements and Company's <br> Preparedness towards BRSR Reporting <br> - Awareness Against Proxy Punching <br> - Business Continuity Management Policy <br> - Principle 1 <br> 1. Code of Ethics <br> 2. Information Security Management System (ISMS) <br> 3. Insider Policy <br> 4. Whistle Blower Reward Policy <br> 5. Process Audit Controls-H.O-Audit <br> - Principle 3 <br> 1. Employee Grievance Cell <br> 2. Employee Personal Details Updation <br> 3. Disciplinary Action for Unauthorized Leave or Absence <br> 4. E-learning Course in MADU Non-Completion <br> 5. Staff Welfare <br> - Principle 4 <br> 1. Unveiling Growth and Resilience <br> - Principle 5 <br> 1. POSH (Prevention of Sexual Harassment) Policy <br> - Principle 6 <br> 1. ESG Policy <br> - Principle 9 <br> 1. Customer Confidentiality <br> 2. Customer Due Diligence <br> 3. Fair Practice Code (FPC) <br> 4. Introduction to KYC AML Policy <br> 5. KYC Policy <br> 6. AML, CFT and Anti-Fraud Compliance Training Programme |  |  |  |", "metadata": {"source": "streamlit_temp_MANAPPURAM_22072024190041_BRSRBSE.pdf", "page": 11, "chunk_index": 0}}, {"text": "| Segment | Total number of training and awareness programmes held | Topics / principles covered under the training and its impact | \\% age of persons in respective category covered by the awareness programmes |\n| :--: | :--: | :--: | :--: |\n| Employees other than BoD and KMPs | 1210 | - Information Security Management System (ISMS) <br> - Business Continuity Management Policy <br> - Introduction Loan Policy <br> - Principle 1 <br> 1. Code of Ethics <br> 2. Whistle Blower Reward Policy <br> 3. Insider Policy <br> 4. Gift Policy <br> 5. Legal Policy <br> 6. AML, CFT, and Anti-Fraud Compliance Training Programme <br> 7. Disciplinary Action for Unauthorized Leave or Absence <br> 8. Employee Speakup Policy <br> - Principle 3: <br> 1. Employee Grievance Cell <br> 2. Staff Welfare Module <br> - Principle 5 <br> 1. POSH (Prevention of Sexual Harassment) Policy <br> - Principle 6 <br> 1. ESG Policy <br> - Principle 8 <br> 1. CSR Policy <br> - Principle 9 <br> 1. Customer Confidentiality <br> 2. Customer Due Diligence <br> 3. Monitoring of Transactions <br> 4. Fair Practice Code (FPC) <br> 5. Customer Handling Skills <br> 6. Customer Service <br> 7. KYC Policy <br> 8. NPA Customer Verification <br> 9. Non-Clearance of CRM Complaints | 9748\\% |\n| Workers |  | Not Applicable |  |", "metadata": {"source": "streamlit_temp_MANAPPURAM_22072024190041_BRSRBSE.pdf", "page": 12, "chunk_index": 0}}, {"text": "2. Details of fines / penalties /punishment/ award/ compounding fees/ settlement amount paid in proceedings (by the entity or by directors / KMPs) with regulators/ law enforcement agencies/ judicial institutions, in the financial year, in the following format (Note: the entity shall make disclosures on the basis of materiality as specified in Regulation 30 of SEBI (Listing Obligations and Disclosure Obligations) Regulations, 2015 and as disclosed on the entity's website):\n\n| Monetary |  |  |  |  |  |\n| :--: | :--: | :--: | :--: | :--: | :--: |\n|  | NGRBC <br> Principle | Name of the regulatory/ enforcement agencies/ judicial institutions | Amount <br> (In INR) | Brief of the Case | Has an appeal been preferred? (Yes/No) |\n| Penalty/ Fine | Principle 1 | RBI | t 20,00,000/- | RBI by an Order dated June 12, 2023 received on June 16, 2023, imposed a monetary penalty of $₹ 20.00$ lakh (Rupees Twenty lakh only) for the non-compliance of provisions of the \"Non-Banking Financial Company - Systemically Important Non-Deposit taking Company and Deposit taking Company (Reserve Bank) Directions, 2016\". The non-compliance with the aforesaid directions to the extent (i) it did not classify certain gold loan accounts with overdue of more than 90 days as Non-Performing Assets (NPAs), and (ii) it did not ensure maintenance of the mandated Loan-toValue (LTV) ratio in certain gold loan accounts during FY 2020-21 | No. |\n|  | Principle 9 | RBI | t42,78,000/- | In connection with the observations made during the Inspection conducted by the RBI for the Financial year ended March 2022, an SCN was issued vide latter CO. ENFD. DENBFC. No.S245/02-1 4- 006/2023-24 dt July 17,2023. RBI that the Company did not pay the auction surplus amounts to $₹ 10.79 \\mathrm{Cr}$ which pertains to 56,854 borrowers whose gold ornaments were auctioned during the period between April 01,2021 and September 30, 2022. Out of the above, 42780 gold loan accounts which were opened/repledged after the date of issuance of Speaking Order dt. November 19, 2020, auction surplus is pending to refund where the time period to refund the surplus is 43 days from the date of completion of auction and for the auction conducted during the April, 01,2021 and September 30,2022, t 8.46 Cr was pending to be repaid to the borrowers as on September 30,2022. RBI by an Order dated November 16, 2023 imposed a monetary penalty of $₹ 42.78$ Lakhs (Rupees Fourty Two Lakhs Seventy Eight Thousand Only) for the above said SCN. | No. |\n| Settlement | - | - | - | - | - |\n| Compounding fee | - | - | - | - | - |\n\nNon-Monetary\n\n|  | NGRBC <br> Principle | Name of the regulatory/ enforcement agencies/ judicial institutions | Brief of the Case | Has an appeal been preferred ? (Yes/No) |\n| :--: | :--: | :--: | :--: | :--: |\n| Imprisonment | - | - | - | - |\n| Punishment | - | - | - | - |", "metadata": {"source": "streamlit_temp_MANAPPURAM_22072024190041_BRSRBSE.pdf", "page": 13, "chunk_index": 0}}, {"text": "3. Of the instances disclosed in Question 2 above, details of the Appeal/ Revision preferred in cases where monetary or non-monetary action has been appealed.\n\nNot applicable. There were no cases of appeal or revision in the financial year.\n4. Does the entity have an anti-corruption or anti-bribery policy? If yes, provide details in brief and if available, provide a web-link to the policy.\n\nYes, Manappuram Finance Limited has a comprehensive anti-corruption and anti-bribery policy in place. The key elements of our policy framework are as follows:\n\n1. Code of Conduct to Regulate, Monitor, and Report Trading by Designated Persons in Securities of Manappuram Finance Limited: This code, in compliance with Regulation 9(1) of the SEBI (Prohibition of Insider Trading) Regulations, 2015, is designed to prevent insider trading, ensuring adherence to securities laws and preserving the company's reputation and integrity. It aims to maintain the confidentiality of Unpublished Price Sensitive Information (UPSI) and prevent its misuse, prohibiting designated persons and their immediate relatives from trading in the company's securities while in possession of UPSI.\n2. Code of Practices and Procedures for Fair Disclosure of Unpublished Price Sensitive Information: As per Regulation 8(1) of the SEBI (Prohibition of Insider Trading) Regulations, 2015, this code ensures the universal and not selective dissemination of UPSI. It outlines the principles, procedures, and practices for uniform and fair disclosure of UPSI by the company.\n3. Fair Practice Code (FPC): Formulated in response to guidelines issued by the Reserve Bank of India, this code outlines fair practices for non-banking financial companies. It has been updated to comply with the Master Direction - Reserve Bank of India (Non-Banking Financial Company - Scale Based Regulation) Directions, 2023, issued on October 19, 2023.\n\nFor further details, please refer to our policies on our official website - https://www.manappuram.com/policies-codes.\n5. Number of Directors/KMPs/employees/workers against whom disciplinary action was taken by any law enforcement agency for the charges of bribery/ corruption:\n\nThere was no instance where disciplinary action was taken by any law enforcement agency for charges of bribery or corruption against directors and KMPs.\n6. Details of complaints with regard to conflict of interest:\n\nThere was no complaints regarding conflict of interest against directors and KMPs.\n7. Provide details of any corrective action taken or underway on issues related to fines / penalties / action taken by regulators/ law enforcement agencies/ judicial institutions, on cases of corruption and conflicts of interest.\n\nThere was no instance where disciplinary action was taken by any law enforcement agency for charges of bribery or corruption against directors and KMPs. Additionally, there was no complaints regarding conflicts of interest against directors and KMPs.\n9. Open-ness of business: Provide details of concentration of purchases and sales with trading houses, dealers, and related parties along-with loans and advances \\& investments, with related parties, in the following format:\na) Concentration of Purchases\n\n|  | FY-2024 <br> (Current Financial Year) | FY-2023 <br> (Previous Financial Year) |\n| :-- | :--: | :--: |\n| Purchases from trading houses as \\% of total purchases | NIL | NIL |\n| Number of trading houses where purchases are made from | NIL | NIL |\n| Purchases from top 10 trading houses as \\% of total purchases from <br> trading houses | NIL | NIL |", "metadata": {"source": "streamlit_temp_MANAPPURAM_22072024190041_BRSRBSE.pdf", "page": 14, "chunk_index": 0}}, {"text": "b) Concentration of Sales\n\n|  | FY-2024 <br> (Current Financial Year) | FY-2023 <br> (Previous Financial Year) |\n| :-- | :--: | :--: |\n| Sales to dealers/ distributors as \\% of total sales | NIL | NIL |\n| Number of dealers/ distributors to whom sales are made | NIL | NIL |\n| Sales to top 10 dealers/ distributors as \\% of total sales to dealers/ <br> distributors | NIL | NIL |\n\nc) Share of RPTs in\n\n|  | FY-2024 <br> (Current Financial Year) | FY-2023 <br> (Previous Financial Year) |\n| :-- | :--: | :--: |\n| Purchases (Purchases with related parties / Total Purchases) | $0.03 \\%$ | $0.05 \\%$ |\n| Sales (Sales to related parties / Total Sales) | $0.10 \\%$ | $0.16 \\%$ |\n| Loans \\& advances (Loans \\& advances given to related parties/Total Loans <br> \\& advances) | $0.58 \\%$ | $0.65 \\%$ |\n| Investments (Investments in related parties / Total Investments made) | $17.63 \\%$ | $78.89 \\%$ |\n\nNote: Manappuram Finance Limited, as a finance company, recognises that its turnover primarily comprises interest income, while its purchases relate to interest payments to lenders.\n\n# Leadership Indicators \n\n1. Awareness programmes conducted for value chain partners on any of the Principles during the financial year:\n\nDuring the financial year, Manappuram Finance Limited did not conduct any specific awareness programmes for our value chain partners on any of the Principles. However, we remain committed to promoting sustainability practices throughout our operations and continually assess opportunities to engage and collaborate with our partners in driving sustainable development. We recognize the importance of fostering awareness and knowledge among our value chain partners, and will explore initiatives to further integrate sustainability principles into our collaborative efforts moving forward.\n2. Does the entity have processes in place to avoid/ manage conflict of interests involving members of the Board? (Yes/No) If Yes, provide details of the same.\nYes, Manappuram Finance Limited maintains robust processes to prevent and manage conflicts of interest involving Board members.\n\n1. Policy on Related Party Transactions: To mitigate potential conflicts, we have implemented a comprehensive Policy on Related Party Transactions. This policy establishes guidelines and procedures for identifying, evaluating, and managing transactions involving related parties, including Board members. It ensures that such transactions are conducted at arm's length and in the best interests of the company and its stakeholders.\n2. Code of Conduct to Regulate, Monitor, and Report Trading by Designated Persons in Securities of Manappuram Finance Limited: In compliance with Regulation 9(1) of the SEBI (Prohibition of Insider Trading) Regulations, 2015, our Code of Conduct regulates, monitors, and reports trading by designated persons in Manappuram Finance Limited's securities. It aims to prevent insider trading, uphold securities laws, and safeguard the company's reputation and integrity. The code strictly prohibits designated persons and their immediate relatives from trading in the company's securities while in possession of Unpublished Price Sensitive Information (UPSI).\n3. Code of Practices and Procedures for Fair Disclosure of Unpublished Price Sensitive Information: As per Regulation 8(1) of the SEBI (Prohibition of Insider Trading) Regulations, 2015, our Fair Disclosure Code ensures the equitable and non-selective dissemination of UPSI. It outlines principles, procedures, and practices for the uniform and fair disclosure of UPSI by the company.\n4. Fair Practice Code (FPC): Developed in accordance with guidelines from the Reserve Bank of India, our Fair Practice Code sets out ethical standards for non-banking financial companies. It has been updated to comply with the Master Direction - Reserve Bank of India (Non-Banking Financial Company - Scale Based Regulation) Directions, 2023, issued on October 19, 2023.", "metadata": {"source": "streamlit_temp_MANAPPURAM_22072024190041_BRSRBSE.pdf", "page": 15, "chunk_index": 0}}, {"text": "# PRINCIPLE 2 Businesses should provide goods and services in a manner that is sustainable and safe \n\n## Essential Indicators\n\n1. Percentage of R\\&D and capital expenditure (capex) investments in specific technologies to improve the environmental and social impacts of product and processes to total R\\&D and capex investments made by the entity, respectively. Not Applicable\n2 a. Does the entity have procedures in place for sustainable sourcing? No.\nb. If yes, what percentage of inputs were sourced sustainably? Not Applicable\n3. Describe the processes in place to safely reclaim your products for reusing, recycling and disposing at the end of life, for (a) Plastics (including packaging) (b) E-waste (c) Hazardous waste and (d) other waste.\nNot Applicable\n4. Whether Extended Producer Responsibility (EPR) is applicable to the entity's activities (Yes / No). If yes, whether the waste collection plan is in line with the Extended Producer Responsibility (EPR) plan submitted to Pollution Control Boards? If not, provide steps taken to address the same\nNo\n\n## Leadership Indicators\n\n1. Has the company conducted Life Cycle Assessments (LCA) for any or all of its top 3 brands/ products manufactured? Not Applicable. Manappuram Finance Limited, being primarily engaged in the financial services sector, has not conducted Life Cycle Perspective Assessments (LCA) for its products or services. The nature of our business does not involve manufacturing products or offering services that typically undergo LCA evaluations. As a non-manufacturing financial services company, our primary focus is on providing a range of financial solutions and services to our customers. Our operations mainly involve financial transactions, risk assessment, and customer service in the domain of gold loans, microfinance, and other related financial products.\n2. If there are any significant social or environmental concerns and/or risks arising from production or disposal of your products / services, as identified in the Life Cycle Perspective / Assessments (LCA) or through any other means, briefly describe the same along-with action taken to mitigate the same.\nWe have not Conducted LCA for our services.\n3. Percentage of recycled or reused input material to total material (by value) used in production (for manufacturing industry) or providing services (for service industry).\nNot Applicable.\n4. Of the products and packaging reclaimed at end of life of products, amount (in metric tonnes) reused, recycled, and safely disposed, as per the following format:\nNot Applicable.\n5. Reclaimed products and their packaging materials (as percentage of products sold) for each product category. Not Applicable.", "metadata": {"source": "streamlit_temp_MANAPPURAM_22072024190041_BRSRBSE.pdf", "page": 16, "chunk_index": 0}}, {"text": "PRINCIPLE 3 Businesses should respect and promote the well-being of all employees, including those in their value chains\n\n# Essential Indicators \n\n1. a. Details of measures for the well-being of employees:\n\n| Category | \\% of employees covered by |  |  |  |  |  |  |  |  |  |\n| :--: | :--: | :--: | :--: | :--: | :--: | :--: | :--: | :--: | :--: | :--: |\n|  | Total <br> (A) | Health insurance |  | Accident insurance |  | Maternity benefits |  | Paternity Benefits |  | Day Care facilities |  |\n|  |  | Number <br> (B) | \\% (B/A) | Number <br> (C) | \\% (C/A) | Number <br> (D) | \\% <br> (D/A) | Number <br> (E) | \\% <br> (E/A) | Number (F) | \\% <br> (F/A) |\n| Permanent employees |  |  |  |  |  |  |  |  |  |  |\n| Male | 16149 | 7633 | 47.26\\% | 11137 | 68.96\\% | 0 | $0 \\%$ | 0 | $0 \\%$ | 0 | $0 \\%$ |\n| Female | 6321 | 2697 | 42.66\\% | 4391 | 69.46\\% | 382 | 6.04\\% | 0 | $0 \\%$ | 0 | $0 \\%$ |\n| Total | 22470 | 10330 | 45.97\\% | 15534 | 69.13\\% | 382 | 1.70\\% | 0 | $0 \\%$ | 0 | $0 \\%$ |\n| Other than Permanent employees |  |  |  |  |  |  |  |  |  |  |\n| Male | 6730 | 392 | 5.82\\% | 405 | 6.01\\% | 0 | $0 \\%$ | 0 | $0 \\%$ | 0 | $0 \\%$ |\n| Female | 520 | 72 | 13.84\\% | 72 | 13.84\\% | 0 | $0 \\%$ | 0 | $0 \\%$ | 0 | $0 \\%$ |\n| Total | 7250 | 464 | 6.40\\% | 477 | 6.57\\% | 0 | $0 \\%$ | 0 | $0 \\%$ | 0 | $0 \\%$ |\n\nb. Details of measures for the well-being of workers:\n\nNot Applicable.\nc. Spending on measures towards well-being of employees and workers (including permanent and other than permanent) in the following format:\n\n|  |  | FY-2024 <br> (Current Financial Year) | FY-2023 <br> (Previous Financial Year) |\n| :--: | :--: | :--: | :--: |\n| Cost incurred on wellbeing measures as a \\% of total revenue of the company | $1.98 \\%$ | $2.38 \\%$ |\n\n2. Details of retirement benefits, for Current FY and Previous Financial Year.\n\n| Benefits | FY-2024 Current Financial Year |  | FY-2023 Previous Financial Year |  |  |\n| :--: | :--: | :--: | :--: | :--: | :--: |\n|  | No. of employees covered as a \\% of total employees | No. of workers covered as a \\% of total workers | Deducted and deposited with the authority (Y/N/N.A.) | No. of employees covered as a \\% of total employees | No. of workers covered as a \\% of total workers | Deducted and deposited with the authority (Y/N/N.A.) |\n| PF | 99.68\\% | 0\\% | Yes | 99.69\\% | 0\\% | Yes |\n| Gratuity | 24.45\\% | 0\\% | Yes | 23.02\\% | 0\\% | Yes |\n| ESI | 64.56\\% | 0\\% | Yes | 68.68\\% | 0\\% | Yes |\n\n3. Accessibility of workplaces\n\nAre the premises / offices of the entity accessible to differently abled employees and workers, as per the requirements of the Rights of Persons with Disabilities Act, 2016? If not, whether any steps are being taken by the entity in this regard.\n\nNo, Manappuram Finance Limited acknowledges that its premises/offices are not currently fully accessible to differently abled employees and workers in accordance with the requirements of the Rights of Persons with Disabilities Act, 2016.\n4. Does the entity have an equal opportunity policy as per the Rights of Persons with Disabilities Act, 2016? If so, provide a weblink to the policy.\nNo\n5. Return to work and Retention rates of permanent employees and workers that took parental leave.\n\n| Gender | Permanent employees |  |  | Permanent workers |  |\n| :--: | :--: | :--: | :--: | :--: | :--: |\n|  | Return to work rate | Retention rate | Return to work rate | Retention rate |  |\n| Male | 0\\% | 0\\% | 0\\% | 0\\% |  |\n| Female | 89.31\\% | 89.32\\% | 0\\% | 0\\% |  |\n| Total | 89.31\\% | 89.32\\% | 0\\% | 0\\% |  |", "metadata": {"source": "streamlit_temp_MANAPPURAM_22072024190041_BRSRBSE.pdf", "page": 17, "chunk_index": 0}}, {"text": "6. Is there a mechanism available to receive and redress grievances for the following categories of employees and worker? If yes, give details of the mechanism in brief.\n\n| Yes/No (If Yes, then give details of the mechanism in brief) |  |\n| :-- | :-- |\n| Permanent Workers | Not Applicable |\n| Other than Permanent Workers | Not Applicable |\n| Permanent Employees | Yes |\n| Other than Permanent Employees | Yes |\n\nNote: Manappuram Finance Limited is committed to maintaining a fair and secure workplace environment for all employees and workers. We have implemented a comprehensive Redressal of Employee Grievance Policy to provide a structured mechanism for employees to voice their concerns. This policy ensures transparency in managing and addressing grievances internally. A grievance under this policy encompasses any issue, concern, problem, or claim-whether perceived or actual-that an employee wishes to formally bring to management's attention for resolution. Our approach aims to foster a supportive work environment where grievances are handled promptly and fairly, reinforcing our commitment to employee welfare and organizational excellence.\n7. Membership of employees and worker in association(s) or Unions recognised by the listed entity.\n\nManappuram Finance Limited does not recognise any employee unions or associations. None of our employees are part of any employee union or association.\n8. Details of training given to employees and workers:\n\n| Category | FY-2024 Current Financial Year |  |  |  | FY-2023 Previous Financial Year |  |  |  |  |\n| :--: | :--: | :--: | :--: | :--: | :--: | :--: | :--: | :--: | :--: |\n|  | Total <br> (A) | On Health and safety measures |  | On Skill <br> upgradation |  | Total <br> (D) | On Health and safety measures |  | On Skill <br> upgradation |\n|  |  | No. (B) | \\% (B/A) | No. (C) | \\% (C/A) |  | No. (E) | \\% (E/D) | No. (F) | \\% (F/D) |\n| Employees |  |  |  |  |  |  |  |  |  |\n| Male | 22879 | 22152 | 96.82\\% | 22152 | 96.82\\% | 22854 | 22727 | 99.44\\% | 22727 | 99.44\\% |\n| Female | 6841 | 6819 | 99.68\\% | 6819 | 99.68\\% | 7860 | 7843 | 99.78\\% | 7843 | 99.78\\% |\n| Total | 29720 | 28971 | 97.48\\% | 28971 | 97.48\\% | 30714 | 30570 | 99.53\\% | 30570 | 99.53\\% |\n| Workers |  |  |  |  |  |  |  |  |  |\n| Male | 0 | 0 | 0\\% | 0 | 0\\% | 0 | 0 | 0\\% | 0 | 0\\% |\n| Female | 0 | 0 | 0\\% | 0 | 0\\% | 0 | 0 | 0\\% | 0 | 0\\% |\n| Total | 0 | 0 | 0\\% | 0 | 0\\% | 0 | 0 | 0\\% | 0 | 0\\% |\n\n9. Details of performance and career development reviews of employees and worker:\n\n| Category | FY-2024 Current Financial Year |  |  |  | FY-2023 Previous Financial Year |  |  |  |  |\n| :--: | :--: | :--: | :--: | :--: | :--: | :--: | :--: | :--: | :--: |\n|  | Total (A) | No. (B) | \\% (B / A) |  | Total (C) |  | No. (D) | \\% (D / C) |  |\n| Employees |  |  |  |  |  |  |  |  |  |\n| Male | 22879 | 9166 | 40.06\\% |  | 22854 |  | 11040 | 48.31\\% |  |\n| Female | 6841 | 1133 | 16.56\\% |  | 7860 |  | 1482 | 18.85\\% |  |\n| Total | 29720 | 10299 | 34.65\\% |  | 30714 |  | 12522 | 40.77\\% |  |\n| Workers |  |  |  |  |  |  |  |  |  |\n| Male | 0 | 0 | 0\\% |  | 0 |  | 0 | 0\\% |  |\n| Female | 0 | 0 | 0\\% |  | 0 |  | 0 | 0\\% |  |\n| Total | 0 | 0 | 0\\% |  | 0 |  | 0 | 0\\% |  |\n\n10. Health and safety management system:\na. Whether an occupational health and safety management system has been implemented by the entity? (Yes/ No). If yes, the coverage such system?\n\nNo. While the nature of our business does not involve inherent occupational health and safety hazards, we are committed to prioritizing the well-being of our employees. We strictly comply with applicable laws and regulations related to workplace safety and have implemented specific measures to address health and safety concerns. Our initiatives include:\n\n1. Fire and Safety Drills: We conduct regular fire and safety drills to ensure preparedness and awareness among employees in case of emergencies.", "metadata": {"source": "streamlit_temp_MANAPPURAM_22072024190041_BRSRBSE.pdf", "page": 18, "chunk_index": 0}}, {"text": "2. Workplace Hygiene and Sanitation: We prioritize proper ventilation, branch hygiene, and sanitation practices to maintain a clean and healthy work environment.\n3. Communication and Awareness: We maintain regular internal communication channels to provide alerts, updates, and reminders to employees regarding health and safety practices. We also conduct awareness sessions to educate employees on various health and safety aspects, such as the importance of wearing helmets, maintaining a healthy lifestyle, staying hydrated, and encouraging physical activity.\n\nManappuram Finance Limited is committed to fostering a safe and healthy work environment.\nb. What are the processes used to identify work-related hazards and assess risks on a routine and non-routine basis by the entity?\n\nNot Applicable.\nc. Whether you have processes for workers to report the work related hazards and to remove themselves from such risks. (Y/N)\n\nNot Applicable.\nd. Do the employees/ worker of the entity have access to non-occupational medical and healthcare services? (Yes/ No) Yes.\n11. Details of safety related incidents, in the following format:\n\nNot Applicable.\n12. Describe the measures taken by the entity to ensure a safe and healthy work place.\n\nManappuram Finance Limited takes several measures to ensure a safe and healthy workplace for its employees. For detailed information, please refer to our response to Princip le 3, Essential Disclosure 10a, where we provide comprehensive details about our efforts in promoting a safe and healthy work environment\n13. Number of Complaints on the following made by employees and workers:\n\n|  | FY-2024 Current Financial Year |  |  | FY-2023 Previous Financial Year |  |  |\n| :--: | :--: | :--: | :--: | :--: | :--: | :--: |\n|  | Filed during the year | Pending resolution at the end of year | Remarks | Filed during the year | Pending resolution at the end of year | Remarks |\n| Working Conditions | 13 | 1 | One complaint settled on April 9, 2024 | 18 | 0 | All complaints settled within the FY |\n| Health \\& Safety | 0 | 0 | Nil | 0 | 0 | Nil |\n\n14. Assessments for the year:\n\n| \\% of your plants and offices that were assessed (by entity or statutory authorities or third parties) |  |\n| :-- | :-- |\n| Working Conditions | $100 \\%$ |\n| Health \\& Safety Practices | $100 \\%$ |\n\nNote: At Manappuram Finance Limited, we are dedicated to maintaining health, safety, and working conditions across our plants and offices. This year, we conducted comprehensive assessments focusing on various aspects critical to ensuring a secure and comfortable environment for both employees and customers. Our security and branch ambiance checklist includes detailed evaluations of the branch interior, customer service area, and scrap management. We inspect the condition of floor tiles to ensure they are free from damage and potential hazards, and we assess the painting status to maintain a professional and well-kept appearance of our branches. In the customer service area, we ensure the availability of sufficient chairs for customers, providing them with comfort while they wait for service. We also check the availability and functionality of fans to guarantee a comfortable environment, especially in regions with higher temperatures. Regular checks are conducted on washroom facilities to maintain cleanliness and hygiene, ensuring they are well-stocked with necessary supplies and functioning property. These thorough assessments reflect our commitment to creating and maintaining a safe, comfortable, and efficient working environment, highlighting our dedication to the well-being of our employees and the satisfaction of our customers.", "metadata": {"source": "streamlit_temp_MANAPPURAM_22072024190041_BRSRBSE.pdf", "page": 19, "chunk_index": 0}}, {"text": "15. Provide details of any corrective action taken or underway to address safety-related incidents (if any) and on significant risks / concerns arising from assessments of health \\& safety practices and working conditions.\nNo major corrective actions were necessitated during the year. We conduct periodic assessments based on our security and branch ambiance checklist to identify and address any concerns proactively. Each branch is responsible for ensuring compliance with the checklist and maintaining the quality standards outlined. These assessments help us continually improve our health and safety practices, ensuring a safe and secure working environment for our employees and customers.\n\n# Leadership Indicators \n\n1. Does the entity extend any life insurance or any compensatory package in the event of death of (A) Employees (Y/N) (B) Workers (Y/N).\nYes. In the event of death, employees are entitled to the following compensatory packages:\n2. Gratuity\n3. Provident Fund Settlement\n4. Employee Deposit Linked Insurance (EDLI)\n5. Group Insurance\n6. Group Personal Accident (GPA) Insurance for accident cases\n7. Provide the measures undertaken by the entity to ensure that statutory dues have been deducted and deposited by the value chain partners.\nManappuram Finance Limited takes the issue of statutory dues seriously and has implemented comprehensive measures to ensure compliance among our value chain partners. Central to these measures is our robust vendor onboarding process. During onboarding, we meticulously evaluate new vendors against stringent criteria that include their track record of adhering to statutory obligations. This rigorous screening process ensures that only those vendors who demonstrate a strong commitment to compliance are integrated into our supply chain.\n\nThrough this robust onboarding process, we aim to foster a culture of transparency, accountability, and adherence to legal requirements across our value chain. By aligning with partners who share our commitment to statutory compliance, we not only mitigate risks but also promote a sustainable and responsible business ecosystem. This strategic approach underpins our dedication to maintaining high standards of operational integrity and supports the long-term success and stability of our business.\n3. Provide the number of employees / workers having suffered high consequence work related injury / ill-health / fatalities (as reported in Q11 of Essential Indicators above), who have been are rehabilitated and placed in suitable employment or whose family members have been placed in suitable employment:\nNot Applicable.\n4. Does the entity provide transition assistance programs to facilitate continued employability and the management of career endings resulting from retirement or termination of employment? (Yes/ No)\nNo, Manappuram Finance Limited does not provide specific transition assistance programs for facilitating continued employability or managing career endings resulting from retirement or termination. However, we ensure that all retiring employees receive their due benefits, including Employee Provident Fund (EPF) and gratuity, which support them financially post-retirement.\n5. Details on assessment of value chain partners:\n\nManappuram Finance Limited did not conduct assessments of our value chain partners during the reporting period.\n6. Provide details of any corrective actions taken or underway to address significant risks / concerns arising from assessments of health and safety practices and working conditions of value chain partners.\nNot Applicable.", "metadata": {"source": "streamlit_temp_MANAPPURAM_22072024190041_BRSRBSE.pdf", "page": 20, "chunk_index": 0}}, {"text": "# PRINCIPLE 4: Businesses should respect the interests of and be responsive to all its stakeholders \n\n## Essential Indicators\n\n1. Describe the processes for identifying key stakeholder groups of the entity\n\nAt Manappuram Finance Limited, we have a comprehensive process in place to identify key stakeholder groups. We recognise the critical role that stakeholders play in the success of our projects. Our approach begins with a meticulous analysis of our operations, allowing us to identify the vital stakeholders involved. These stakeholders include Shareholders \\& Investors, Employees, Customers, Business partners, Suppliers, Local Communities, Government and Regulators Furthermore, we extend our considerations to the impact our projects have on the local communities in which we operate. We value these communities as crucial stakeholders in our communication efforts. By understanding the needs and concerns of our stakeholders, we actively address their expectations, mitigate potential risks, and foster enduring relationships that are essential to our overall prosperity. Importantly, our stakeholder identification process is an ongoing endeavour. We continuously strive to remain informed, engaged, and responsive to the ever-evolving needs of our stakeholders. This commitment allows us to effectively manage our relationships, promote sustainable practices, and drive long-term value for all stakeholders involved.\n2. List of stakeholder groups identified as key for your entity and the frequency of engagement with each stakeholder group.\n\n| Stakeholder <br> Group | Whether identified as Vulnerable \\& Marginalized Group (Yes/No) | Channels of communication (Email, SMS, Newspaper, Pamphlets, Advertisement, Community Meetings, Notice Board, Website), Other | Frequency of engagement (Annually/ Half yearly/ Quarterly / others - please specify) | Purpose and scope of engagement including key topics and concerns raised during such engagement |\n| :--: | :--: | :--: | :--: | :--: |\n| Shareholders and Investors | No | Email, Newspaper, Website, SMS, Post | Quarterly | - Update of the company <br> - Call for meeting |\n| Employees | No | Email, Website, SMS. | As Required | - Update of company <br> - Work update |\n| Customers | No | Email, Website, SMS, Newspaper, Post | As Required | - To share new loan scheme <br> - Interest rate changes <br> - To intimate due date for payment, auction related and other statuary intimations |\n| Business partners | No | Email, Website | As Required | - Update of the company |\n| Suppliers | No | Email | As Required | - Update of the company <br> - Official communication like Purchase order, payment confirmation, Collecting quotation etc |\n| Local Communities | Yes | Website, Social Media Post | As Required | - Educate local communities on the initiatives and benefits. <br> - Collect feedback from community leaders and members. <br> - Address grievances raised by local communities. |\n| Government and Regulators | No | Email, Post | As Required | - Update compliance <br> - Take regulatory approvals and regulatory intimations |\n\n## Leadership Indicators\n\n1. Provide the processes for consultation between stakeholders and the Board on economic, environmental, and social topics or if consultation is delegated, how is feedback from such consultations provided to the Board.\nAt Manappuram Finance Limited, we value the input and perspectives of our stakeholders on economic, environmental, and social topics. We have established effective processes for consultation between stakeholders and the Board to ensure their feedback is considered in our decision-making. We engage in consultations through various channels such as meetings, surveys, feedback mechanisms, and stakeholder forums. These platforms allow stakeholders to express their views, raise concerns, and provide suggestions. To facilitate the flow of information, we have established a structured reporting mechanism. This includes regular reporting on stakeholder engagement activities, key issues raised, and actions taken in response to stakeholder feedback. This reporting enables the Board to assess the impact of our operations, identify areas for improvement, and make informed decisions. We believe that ongoing consultation with our stakeholders is crucial for building trust, fostering collaboration, and", "metadata": {"source": "streamlit_temp_MANAPPURAM_22072024190041_BRSRBSE.pdf", "page": 21, "chunk_index": 0}}, {"text": "achieving sustainable outcomes. By actively involving stakeholders in our decision-making processes, we aim to ensure that their interests and concerns are adequately addressed and that our actions align with their expectations.\n2. Whether stakeholder consultation is used to support the identification and management of environmental, and social topics (Yes / No). If so, provide details of instances as to how the inputs received from stakeholders on these topics were incorporated into policies and activities of the entity.\nNo\n3. Provide details of instances of engagement with, and actions taken to, address the concerns of vulnerable/ marginalized stakeholder groups\nAt Manappuram Finance Limited, we are dedicated to engaging with and addressing the concerns of vulnerable and marginalized stakeholder groups, recognizing the importance of understanding their unique needs and striving to make a positive impact on their lives. Our activities include:\n\n1. Conducted Surveys: We engaged directly with local communities to understand their specific requirements and challenges.\n2. Collaboration with Local Representatives: We worked with local representatives, community leaders, and relevant organizations to gain a deeper understanding of the concerns faced by these groups.\n3. Feedback Surveys: We conducted feedback surveys to evaluate the effectiveness of our programs and initiatives targeting these groups.\n4. Educational Support: We provided scholarships and educational materials to children from marginalized communities, enabling them to pursue their studies without financial burden.\n5. Healthcare Initiatives: We organized health camps and provided free medical check-ups and treatments, ensuring access to essential healthcare services.\n6. Skill Development Programs: We conducted vocational training and skill development workshops to enhance employability and income-generation opportunities.\n7. Infrastructure Development: We improved local infrastructure, such as building community centers and sanitation facilities, to enhance living conditions.\n8. Emergency Relief Efforts: We provided immediate relief and rehabilitation support during natural disasters and crises, ensuring timely assistance.\n9. Women Empowerment: We launched initiatives focused on empowering women through self-help groups, micro-financing, and entrepreneurship programs.\n10. Livelihood Support: We provided tools, resources, and financial assistance to support small-scale businesses and agricultural activities, helping individuals sustain their livelihoods.\n\nManappuram Finance Limited remains committed to fostering inclusive growth and social development, continually striving to address the concerns of vulnerable and marginalized stakeholder groups and contributing to their upliftment for a more inclusive and equitable society.\n\n# PRINCIPLE 5 Businesses should respect and promote human rights \n\n## Essential Indicators\n\n1. Employees and workers who have been provided training on human rights issues and policy(ies) of the entity, in the following format:\n\n| Category | FY-2024 Current Financial Year |  |  | FY-2023 Previous Financial Year |  |  |\n| :--: | :--: | :--: | :--: | :--: | :--: | :--: |\n|  | Total (A) | No. of employees / workers covered (B) | \\% (B / A) | Total (C) | No. of employees / workers covered (D) | \\% (D / C) |\n| Employees |  |  |  |  |  |  |\n| Permanent | 22879 | 22152 | 96.82\\% | 22854 | 22727 | 99.44\\% |\n| Other than Permanent | 6841 | 6819 | 99.68\\% | 7860 | 7843 | 99.78\\% |\n| Total Employees | 29720 | 28971 | 97.48\\% | 30714 | 30570 | 99.53\\% |\n| Workers |  |  |  |  |  |  |\n| Permanent | 0 | 0 | 0\\% | 0 | 0 | 0\\% |\n| Other than Permanent | 0 | 0 | 0\\% | 0 | 0 | 0\\% |\n| Total Workers | 0 | 0 | 0\\% | 0 | 0 | 0\\% |", "metadata": {"source": "streamlit_temp_MANAPPURAM_22072024190041_BRSRBSE.pdf", "page": 22, "chunk_index": 0}}, {"text": "2. Details of minimum wages paid to employees and workers, in the following format:\n\n| Category | FY-2024 Current Financial Year |  |  |  | FY-2023 Previous Financial Year |  |  |  |  |\n| :--: | :--: | :--: | :--: | :--: | :--: | :--: | :--: | :--: | :--: |\n|  | Total <br> (A) | Equal to Minimum Wage |  | More than Minimum Wage | Total <br> (D) | Equal to Minimum Wage |  | More than Minimum Wage |  |\n|  |  | No. (B) | \\% (B/A) | No. (C) | \\% (C/A) |  | No. (E) | \\% (E/D) | No. (F) | \\% (F/D) |\n| Employees |  |  |  |  |  |  |  |  |  |\n| Permanent | 22470 | 4351 | 19.36\\% | 18119 | 80.64\\% | 23805 | 5451 | 22.90\\% | 18354 | 77.10\\% |\n| Male | 16149 | 3358 | 20.79\\% | 12791 | 79.21\\% | 17040 | 4194 | 24.61\\% | 12846 | 75.39\\% |\n| Female | 6321 | 993 | 15.71\\% | 5328 | 84.29\\% | 6765 | 1257 | 18.58\\% | 5508 | 81.42\\% |\n| Other than Permanent | 7250 | 4058 | 55.97\\% | 3192 | 44.03\\% | 6909 | 3115 | 45.09\\% | 3794 | 54.91\\% |\n| Male | 6730 | 3797 | 56.42\\% | 2933 | 43.58\\% | 5814 | 2516 | 43.27\\% | 3298 | 56.73\\% |\n| Female | 520 | 261 | 50.19\\% | 259 | 49.81\\% | 1095 | 599 | 54.70\\% | 496 | 45.30\\% |\n| Workers |  |  |  |  |  |  |  |  |  |\n| Permanent | 0 | 0 | 0\\% | 0 | 0\\% | 0 | 0 | 0\\% | 0 | 0\\% |\n| Male | 0 | 0 | 0\\% | 0 | 0\\% | 0 | 0 | 0\\% | 0 | 0\\% |\n| Female | 0 | 0 | 0\\% | 0 | 0\\% | 0 | 0 | 0\\% | 0 | 0\\% |\n| Other than Permanent | 0 | 0 | 0\\% | 0 | 0\\% | 0 | 0 | 0\\% | 0 | 0\\% |\n| Male | 0 | 0 | 0\\% | 0 | 0\\% | 0 | 0 | 0\\% | 0 | 0\\% |\n| Female | 0 | 0 | 0\\% | 0 | 0\\% | 0 | 0 | 0\\% | 0 | 0\\% |\n\n3. a Details of remuneration/salary/wages\n\n|  | Male |  | Female |  |\n| :-- | :--: | :--: | :--: | :--: |\n|  | Number | Median remuneration/ salary/ <br> wages of respective category | Number | Median remuneration/ salary/ <br> wages of respective category |\n| Board of Directors (BoD) | 10 | $\\$ 4,572,500$ | 3 | $\\$ 4,165,000$ |\n| Key Managerial Personnel | 2 | $\\$ 55,648,032$ | 2 | $\\$ 13,477,500$ |\n| Employees other than BoD and KMP | 22877 | $\\$ 290,995$ | 6839 | $\\$ 298,140$ |\n| Workers | Not Applicable |  |  |  |\n\n3. b Gross wages paid to females as \\% of total wages paid by the entity, in the following format:\n\n|  | FY-2024 <br> (Current Financial Year) | FY-2023 <br> (Previous Financial Year) |\n| :-- | :--: | :--: |\n| Gross wages paid to females as \\% of total wages | $21.47 \\%$ | $22.24 \\%$ |\n\n4. Do you have a focal point (Individual/ Committee) responsible for addressing human rights impacts or issues caused or contributed to by the business? (Yes/No)\nManappuram Finance Limited recognizes the importance of addressing human rights impacts and issues within our operations. We have established robust frameworks to ensure compliance and promote a fair and safe workplace environment.\n5. Protection of Women Against Sexual Harassment at Workplace (POSH): We have implemented a comprehensive POSH policy, in line with legal mandates, which includes the formation of Internal Compliance Committees (ICC) at both our Registered Office and Regional Levels. These committees are tasked with addressing and resolving complaints related to sexual harassment promptly and effectively.\n6. Redressal of Employee Grievances: At Manappuram Group, we prioritize maintaining a supportive workplace culture. Our Redressal of Employee Grievance Policy provides a structured mechanism for employees to raise and resolve grievances in a transparent manner. This policy underscores our commitment to addressing any issues or concerns raised by employees through a dedicated Employee Grievances Redressal Committee established at the Group level.\n\nThese initiatives are integral to our commitment to upholding human rights principles across our business operations.", "metadata": {"source": "streamlit_temp_MANAPPURAM_22072024190041_BRSRBSE.pdf", "page": 23, "chunk_index": 0}}, {"text": "5. Describe the internal mechanisms in place to redress grievances related to human rights issues.\n\nManappuram Finance Limited maintains dedicated mechanisms to address human rights impacts or issues arising from our operations.\n\n1. POSH Complaint Process: Any aggrieved woman can submit a written complaint to our Internal Complaints Committee (ICC) or via email to \"icc@manappuram.com\" within three months of the incident, extendable with valid reasons. The ICC conducts conciliation and, if needed, inquiry proceedings with powers similar to a civil court. Recommendations by the ICC are acted upon by MAFIL management, ensuring confidentiality and imposing penalties for breaches. Appeals against ICC decisions can be filed within ninety days.\n2. Employee Grievance Redressal Process: Employees must initially report grievances in writing to their immediate supervisor, who aims to resolve them within 2 working days. Unresolved or escalated matters are directed to the HR Grievance Officer via the DotNet Module. Grievances are categorized and investigated promptly, with escalation to higher committees if necessary. Strict timelines ensure timely resolution, with opportunities for employee feedback to drive continuous improvement. These processes underscore our commitment to fostering a supportive and compliant workplace environment.\n3. Number of Complaints on the following made by employees and workers:\n\n|  | FY-2024 Current Financial Year |  | FY-2023 Previous Financial Year |  |\n| :--: | :--: | :--: | :--: | :--: |\n|  | Filed during the year | Pending resolution at the end of year | Filed during the year | Pending resolution at the end of year | Remarks |\n| Sexual Harassment | 2 | 0 | 7 | 0 |\n| Discrimination at workplace | 0 | 0 | 0 | 0 |\n| Child Labour | 0 | 0 | 0 | 0 |\n| Forced Labour/Involuntary Labour | 0 | 0 | 0 | 0 |\n| Wages | 0 | 0 | 0 | 0 |\n| Other human rights related issues | 0 | 0 | 0 | 0 |\n\n7. Complaints filed under the Sexual Harassment of Women at Workplace (Prevention, Prohibition and Redressal) Act, 2013, in the following format:\n\n|  | FY-2024 <br> (Current Financial Year) | FY-2023 <br> (Previous Financial Year) |\n| :-- | :--: | :--: |\n| Total Complaints reported under Sexual Harassment on of Women at <br> Workplace (Prevention, Prohibition and Redressal) Act, 2013 (POSH) | 2 | 7 |\n| Complaints on POSH as a \\% of female employees / workers | .03\\% | .08\\% |\n| Complaints on POSH upheld | 1 | 4 |\n\n8. Mechanisms to prevent adverse consequences to the complainant in discrimination and harassment cases.\n\nComplaints filed under the Sexual Harassment of Women at Workplace (Prevention, Prohibition, and Redressal) Act, 2013, are handled with strict confidentiality measures in place at Manappuram Finance Limited.\n\nSecrecy \\& Penalty for Violation: To uphold confidentiality, the following information pertaining to complaints:\n\n1. Contents of the complaint by the aggrieved woman.\n2. Identities and addresses of the aggrieved woman, respondent, and witnesses\n3. Details related to conciliation and inquiry proceedings\n4. Recommendations of the Internal Committee (IC), and\n5. Actions taken by the employer-must not be disclosed to the public, press, or media. This obligation supersedes any provisions under the RTI Act.\n\nWhile ensuring confidentiality, information regarding justice achieved for victims can be shared without revealing identifiable details. Any breach of confidentiality by individuals handling complaints or recommendations will result in disciplinary action as per their service rules.", "metadata": {"source": "streamlit_temp_MANAPPURAM_22072024190041_BRSRBSE.pdf", "page": 24, "chunk_index": 0}}, {"text": "9. Do human rights requirements form part of your business agreements and contracts? (Yes/No)\n\nNo Human rights requirements currently do not form part of the business agreements and contracts, but we encourage our value chain to ensure compliance with human rights requirements.\n10. Assessments for the year:\n\nNot Applicable.\n11. Provide details of any corrective actions taken or underway to address significant risks / concerns arising from the assessments at Question 9 above.\n\nNot Applicable.\n\n# Leadership Indicators \n\n1. Details of a business process being modified / introduced as a result of addressing human rights grievances/complaints. Not Applicable.\n2. Details of the scope and coverage of any Human rights due-diligence conducted. Not Applicable.\n3. Is the premise/office of the entity accessible to differently abled visitors, as per the requirements of the Rights of Persons with Disabilities Act, 2016?\n\nNo Manappuram Finance Limited acknowledges that its premises/offices are not currently fully accessible to differently abled employees and workers in accordance with the requirements of the Rights of Persons with Disabilities Act, 2016. However, we are committed to promoting inclusivity and ensuring equal opportunities for all individuals.\n4. Details on assessment of value chain partners:\n\nNot Applicable.\n5. Provide details of any corrective actions taken or underway to address significant risks / concerns arising from the assessments at Question 4 above.\n\nNot Applicable.", "metadata": {"source": "streamlit_temp_MANAPPURAM_22072024190041_BRSRBSE.pdf", "page": 25, "chunk_index": 0}}, {"text": "PRINCIPLE 6: Businesses should respect and make efforts to protect and restore the environment Essential Indicators\n1 Details of total energy consumption (in Joules or multiples) and energy intensity, in the following format:\n\n|  | FY-2024 <br> (Current Financial Year) | FY-2023 <br> (Previous Financial Year) |\n| :--: | :--: | :--: |\n| From renewable sources |  |  |\n| Total electricity consumption (A) | 228.31 GJ | 192.43 GJ |\n| Total fuel consumption (B) | - | - |\n| Energy consumption through other sources (C) | - | - |\n| Total energy consumed from renewable sources (A+B+C) | 228.31 GJ | 192.43 GJ |\n| From non-renewable sources |  |  |\n| Total electricity consumption (D) | 64985.23 GJ | 61128.04 GJ |\n| Total fuel consumption (E) | 1955.35 GJ | 1368.60 GJ |\n| Energy consumption through other sources (F) | - | - |\n| Total energy consumed from non- renewable sources (D+E+F) | 66940.58 GJ | 62496.64 GJ |\n| Total energy consumed (A+B+C+D+E+F) | 67168.90 GJ | 62689.08 GJ |\n| Energy intensity per rupee of turnover (Total energy consumed / Revenue from operations) | 11.52 GJ/Crore | 13.01 GJ/ Crore |\n| Energy intensity per rupee of turnover adjusted for Purchasing Power Parity (PPP) (Total energy consumed / Revenue from operations adjusted for PPP) | 26.36 GJ/ Million | 29.79 GJ/ Million |\n| Energy intensity in terms of physical output | - | - |\n| Energy intensity (optional) - the relevant metric may be selected by the entity | - | - |\n\n2. Does the entity have any sites / facilities identified as designated consumers (DCs) under the Performance, Achieve and Trade (PAT) Scheme of the Government of India? (Y/N) If yes, disclose whether targets set under the PAT scheme have been achieved. In case targets have not been achieved, provide the remedial action taken, if any.\nNot Applicable.\n3. Provide details of the following disclosures related to water, in the following format:\n\n| Parameter | FY-2024 <br> (Current Financial Year) | FY-2023 <br> (Previous Financial Year) |\n| :--: | :--: | :--: |\n| Water withdrawal by source (in kilolitres) |  |  |\n| (i) Surface water | - | - |\n| (ii) Groundwater | 16262.5 KL | 16262.5 KL |\n| (iii) Third party water | 337.36 KL | 97 KL |\n| (iv) Seawater / desalinated water | - | - |\n| (v) Others | - | - |\n| Total volume of water withdrawal (in kilolitres) (i + ii + iii + iv + v) | 16599.86 KL | 16359.5 KL |\n| Total volume of water consumption (in kilolitres) | 0 | 0 |\n| Water intensity per rupee of turnover (Total water consumption / Revenue from operations) | 2.84 KL/Crore | 3.39 KL/Crore |\n| Water intensity per rupee of turnover adjusted for Purchasing Power Parity (PPP) (Total water consumption / Revenue from operations adjusted for PPP) | 6.51 KL/ Million | 7.77 KL/ Million |\n| Water intensity in terms of physical output |  |  |\n| Water intensity (optional) - the relevant metric may be selected by the entity |  |  |\n\nNote: The water withdrawal data provided pertains to drinking water and groundwater. Data from third-party water sources at branches is not included.", "metadata": {"source": "streamlit_temp_MANAPPURAM_22072024190041_BRSRBSE.pdf", "page": 26, "chunk_index": 0}}, {"text": "4. Provide the following details related to water discharged:\n\n| Parameter |  | FY-2024 <br> (Current Financial Year) | FY-2023 <br> (Previous Financial Year) |\n| :--: | :--: | :--: | :--: |\n| Water discharge by destination and level of treatment (in kilolitres) |  |  |  |\n| (i) Surface water |  |  |  |\n| - | No treatment | - | - |\n| - | With treatment - please specify level of treatment | - | - |\n| (ii) Groundwater |  |  |  |\n| - | No treatment | - | - |\n| - | With treatment - please specify level of treatment | - | - |\n| (iii) Third party water |  |  |  |\n| - | No treatment | 16599.86 KL | 16359.5 KL |\n| - | With treatment - please specify level of treatment | - | - |\n| (iv) Seawater / desalinated water |  |  |  |\n| - | No treatment | - | - |\n| - | With treatment - please specify level of treatment | - | - |\n| (v) Others |  |  |  |\n| - | No treatment | - | - |\n| - | With treatment - please specify level of treatment | - | - |\n| Total water discharged (in kilolitres) |  | 16599.86 KL | 16359.5 KL |\n\nNote: The water discharge data provided pertains to drinking water and groundwater. Data from third-party water sources at branches is not included.\n5. Has the entity implemented a mechanism for Zero Liquid Discharge? If yes, provide details of its coverage and implementation. Not Applicable.\n6. Please provide details of air emissions (other than GHG emissions) by the entity, in the following format: Not Applicable.\n7. Provide details of greenhouse gas emissions (Scope 1 and Scope 2 emissions) \\& its intensity, in the following format:\n\n| Parameter | Unit | FY-2024 <br> (Current Financial Year) | FY-2023 <br> (Previous Financial Year) |\n| :--: | :--: | :--: | :--: |\n| Total Scope 1 Emissions | TCO2e | 138.88 | 95.66 |\n| Total Scope 2 Emissions | TCO2e | 12924.84 | 12072.78 |\n| Total Scope 1 and Scope 2 emission intensity per rupee of turnover (Total Scope 1 and Scope 2 GHG emissions / Revenue from operations) | TCO2e/ <br> Crore | 2.24 | 2.52 |\n| Total Scope 1 and Scope 2 emission intensity per rupee of turnover adjusted for Purchasing Power Parity (PPP) (Total Scope 1 and Scope 2 GHG emissions / Revenue from operations adjusted for PPP) | TCO2e/ <br> Million | 5.12 | 5.78 |\n| Total Scope 1 and Scope 2 emission intensity in terms of physical output |  |  |  |\n| Total Scope 1 and Scope 2 emission intensity (optional) the relevant metric may be selected by the entity |  |  |  |\n\n8. Does the entity have any project related to reducing Green House Gas emission? If Yes, then provide details.\n\nManappuram Finance Limited is dedicated to reducing Greenhouse Gas (GHG) emissions through several strategic initiatives:\n\n1. Solar Electrification: We are implementing solar electrification systems across our head and branch offices to decrease our reliance on purchased electricity. This year, we achieved an $18 \\%$ increase in solar electricity production compared to FY 2022-23, demonstrating our commitment to expanding renewable energy usage.", "metadata": {"source": "streamlit_temp_MANAPPURAM_22072024190041_BRSRBSE.pdf", "page": 27, "chunk_index": 0}}, {"text": "2. Electric Vehicle Fleet: We are actively transitioning our vehicle fleet to electric vehicles (EVs). This initiative not only aims to reduce carbon emissions but also promotes sustainable transportation practices. In the reporting year, our adoption of electric vehicles has resulted in a reduction of 1923 KgCO2e emissions.\n\nThese efforts underscore our firm commitment to environmental sustainability and align with our goals to mitigate climate change impacts within our operational footprint.\n9. Provide details related to waste management by the entity, in the following format:\n\n| Parameter | FY-2024 <br> (Current Financial Year) | FY-2023 <br> (Previous Financial Year) |\n| :--: | :--: | :--: |\n| Total Waste generated (in metric tonnes) |  |  |\n| Plastic waste (A) | 1.462 | 0.601 |\n| E-waste (B) | - | - |\n| Bio-medical waste (C) | - | - |\n| Construction and demolition waste (D) | - | - |\n| Battery waste (E) | - | - |\n| Radioactive waste (F) | - | - |\n| Other Hazardous waste. Please specify, if any. (G) | - | - |\n| Other Non- hazardous waste generated (H). Please specify, if any. (Breakup by composition i.e. by materials relevant to the sector) | - | - |\n| Total (A+B+C+D+E+F+G+H) | 1.462 | 0.601 |\n| Waste intensity per rupee of turnover (Total waste generated / Revenue from operations) | 0.0002 MT/ Crore | 0.0001 MT/ Crore |\n| Waste intensity per rupee of turnover adjusted for Purchasing Power Parity (PPP) (Total waste generated / Revenue from operations adjusted for PPP) | 0.0005 MT/ Million | 0.0003 MT/ Million |\n| Waste intensity in terms of physical output | - | - |\n| Waste intensity (optional) the relevant metric may be selected by the entity | - | - |\n| For each category of waste generated, total waste recovered through recycling, re-using or other recovery operations (in metric tonnes) |  |  |\n| Recycled | - | - |\n| Re-used | - | - |\n| Other recovery operations | - | - |\n| Total | - | - |\n| For each category of waste generated, total waste disposed by nature of disposal method (in metric tonnes) |  |  |\n| Incineration | - | - |\n| Landfilling | - | - |\n| Other disposal operations | - | - |\n| Total | - | - |\n\nNote: The waste data provided pertains solely to the head office of Manappuram Finance Limited.\n10. Briefly describe the waste management practices adopted in your establishments. Describe the strategy adopted by your company to reduce usage of hazardous and toxic chemicals in your products and processes and the practices adopted to manage such wastes.\nAt Manappuram Finance Limited, we prioritise sustainable waste management and responsible chemical usage across our operations. Our approach includes sending plastic and e-waste to accredited third-party recyclers for proper recycling and disposal. Specifically, for e-waste, rigorous protocols ensure that hard drives are removed securely before disposal through trusted third-party services.\n11. If the entity has operations/offices in/around ecologically sensitive areas (such as national parks, wildlife sanctuaries, biosphere reserves, wetlands, biodiversity hotspots, forests, coastal regulation zones etc.) where environmental approvals / clearances are required, please specify details in the following format:\nNot Applicable.", "metadata": {"source": "streamlit_temp_MANAPPURAM_22072024190041_BRSRBSE.pdf", "page": 28, "chunk_index": 0}}, {"text": "12. Details of environmental impact assessments of projects undertaken by the entity based on applicable laws, in the current financial year:\nNot Applicable.\n13. Is the entity compliant with the applicable environmental law/ regulations/ guidelines in India; such as the Water (Prevention and Control of Pollution) Act, Air (Prevention and Control of Pollution) Act, Environment protection act and rules thereunder (Y/N). If not, provide details of all such non-compliances, in the following format:\nNot Applicable.\n\n# Leadership Indicators \n\n1. Water withdrawal, consumption and discharge in areas of water stress (in kilolitres): For each facility / plant located in areas of water stress, provide the following information: (i) Name of the area (ii) Nature of operations (iii) Water withdrawal, consumption and discharge in the following format:\nNot Applicable.\n2. Please provide details of total Scope 3 emissions \\& its intensity, in the following format:\n\nNot Applicable.\n3. With respect to the ecologically sensitive areas reported at Question 11 of Essential Indicators above, provide details of significant direct \\& indirect impact of the entity on biodiversity in such areas along-with prevention and remediation activities.\nNot Applicable.\n4. If the entity has undertaken any specific initiatives or used innovative technology or solutions to improve resource efficiency, or reduce impact due to emissions / effluent discharge / waste generated, please provide details of the same as well as outcome of such initiatives, as per the following format:\nNot Applicable.\n5. Does the entity have a business continuity and disaster management plan? Give details in 100 words/ web link.\n\nYes, Manappuram Finance Limited (MAFIL) has established a robust Business Continuity and Disaster Management Plan that encompasses critical processes across various departments. These include Gold Loan Sales \\& Collection, Branch Operations, IT, Accounts \\& Finance, E Security, and other loan departments at our head office, corporate office, and field locations. The policy mandates compliance for all personnel to mitigate operational risks, protect assets, and uphold our corporate reputation during disruptions. A dedicated BCM Steering Committee oversees strategic aspects and ensures policy adherence. A BC Manager coordinates BCM activities, including plan development, testing, and reporting. Business Continuity Plan (BCP) owners within each service area oversee implementation, supported by BC Champions and support functions to facilitate planning, execution, and continuous improvement. The BCM Steering Committee, comprising management representatives, conducts annual reviews and updates the policy as needed to adapt to significant changes or emerging risks.\n6. Disclose any significant adverse impact to the environment, arising from the value chain of the entity. What mitigation or adaptation measures have been taken by the entity in this regard.\nNot Applicable\n7. Percentage of value chain partners (by value of business done with such partners) that were assessed for environmental impacts.\nNot Applicable.", "metadata": {"source": "streamlit_temp_MANAPPURAM_22072024190041_BRSRBSE.pdf", "page": 29, "chunk_index": 0}}, {"text": "PRINCIPLE 7 Businesses, when engaging in influencing public and regulatory policy, should do so in a manner that is responsible and transparent\n\n# Essential Indicators \n\n1. a. Number of affiliations with trade and industry chambers/associations.\n\n2\nb. List the top 10 trade and industry chambers/ associations (determined based on the total members of such body) the entity is a member of/ affiliated to.\nS. Name of the trade and industry chambers/ associations\nNo.\n\n1 Finance Industry Development Council\nNational.\n2 Federation of Indian Chambers of Commerce and Industry\nNational.\n2. Provide details of corrective action taken or underway on any issues related to anticompetitive conduct by the entity, based on adverse orders from regulatory authorities.\nNo incidents of Anti-competitive conduct.\n\n## Leadership Indicators\n\n1. Details of public policy positions advocated by the entity:\n\nNot Applicable.\n\n## PRINCIPLE 8 Businesses should promote inclusive growth and equitable development\n\n## Essential Indicators\n\n1. Details of Social Impact Assessments (SIA) of projects undertaken by the entity based on applicable laws, in the current financial year.\n\n| Name and brief details of project | SIA <br> Notification No. | Date of notification | Whether conducted by independent external agency (Yes / No) | Results communicated in public domain (Yes / No) | Relevant Web link |\n| :--: | :--: | :--: | :--: | :--: | :--: |\n| Promotion of healthcare- Ambulance Project : <br> Manappuram's ambulance initiative comprises a fleet of seven vehicles serving the needs of Thrissur and Kochi district. Among these, five are specialized NICU-PICU ambulances primarily designated for the transportation of children and babies in need of critical care. These ambulances are equipped with specialized equipment and trained medical personnel to cater specifically to the needs of paediatric patients. The organization also has one ICCU ambulance dedicated to critical care. The fleet also comprises a non-ICU ambulance, which is utilized for non-critical medical transports, such as routine medical transfers or emergencies that do not require intensive care facilities during transportation. The first ambulance was acquired in 2016. The majority of the fleet expansion occurred in 2021, with the acquisition of five ambulances. This significant investment was a response to MAFIL' | - | - | Yes | No | - |\n| Promotion of healthcare- Development of Gym, fitness, yoga, swimming pool and Mahima Counselling centre: <br> Mahima Counselling centre: Mahima Centre works towards providing a holistic approach to addressing various psychological, developmental, and educational challenges individuals face across different stages of life. The centre offers a wide range of services tailored to meet the unique needs of clients, from children with speech delays to adults seeking career guidance or managing mental health issues. The centre is located in Valappad, Thrissur, which essentially is a fishing hamlet where a majority of people come from predominantly marginalized backgrounds, | - | - | Yes | No | - |", "metadata": {"source": "streamlit_temp_MANAPPURAM_22072024190041_BRSRBSE.pdf", "page": 30, "chunk_index": 0}}, {"text": "| Name and brief details of project | SIA <br> Notification <br> No. | Date of notification | Whether conducted by independent external agency (Yes / No) | Results communicated in public domain (Yes / No) | Relevant <br> Web link |\n| :--: | :--: | :--: | :--: | :--: | :--: |\n\nGym: At the premium gym in Valappad, individuals have access to a high-quality fitness experience guided by professional instructors and equipped with state-of-the-art branded fitness equipment. Catering to diverse fitness goals and levels, the centre offers personalized programs designed to engage individuals in achieving their desired results. Beginning with individualized assessments, the centre tailors exercise regimens to each individual's starting fitness level. The gym offers personalized training, monthly personal fitness programs, regular reevaluations, features like spacious relaxation lounges, shower facilities, and steam rooms.\n\nAquatic Complex: Located in Valappad, the Manappuram Aquatic Complex offers a retreat for swimmers in and around the geographic area. Its main pool, spanning 25 meters in length and 12 meters in width with a depth of 5 feet, provides ample space for various activities. International certified trainers also provide coaching sessions for individuals of all ages, including special programs for differently abled swimmers. The complex operates from 6:00 AM to 9:00PM and has adequate parking and hygienic facilities.\n\nYoga Centre: Manappuram Yoga Centres, situated in Thrissur and Valappad, cater to individuals of all ages and proficiency levels, offering a diverse range of yoga classes and workshops. With a focus on promoting holistic well-being encompassing physical, mental, and spiritual aspects, these centres provide a nurturing environment for yoga practice. Various yoga disciplines such as Hatha Yoga, Ashtanga Yoga, Vinyasa Yoga, and Pranayama are taught by certified yoga instructors, ensuring personalized attention for each participant. Through these classes, individuals are empowered to understand the transformative benefits of yoga.\n\nBadminton Court: Established in 2022 within Painoor, Valappad, the badminton court offers a dedicated space for training and practice sessions catering to both athletes and individuals alike. It provides comprehensive training programs tailored to different proficiency levels, including beginners, intermediate, and adult coaching. Both group sessions and individualized training are available, ensuring personalized attention and guidance. Operating from 6:00 AM to 9:00 PM, the court ensures convenient access for enthusiasts, with ample parking and well-maintained hygienic facilities\n\n## Promotion of healthcare- Expansion of Macare diagnostics:\n\nMa Care is a chain of polyclinics in Kerala that are committed to delivering high-quality radiology and lab services. Equipped with state-of-theart technologies, Ma Care ensures seamless and modern healthcare delivery. With $1 / 4$ departments offering speciality and super-speciality services, patients have the option for both walk-in consultations and online video consultations, as well as access to an online pharmacy. Ma Care's services extend across Thrissur and Kochi districts, catering to a diverse population.", "metadata": {"source": "streamlit_temp_MANAPPURAM_22072024190041_BRSRBSE.pdf", "page": 31, "chunk_index": 0}}, {"text": "| Name and brief details of project | SIA <br> Notification <br> No. | Date of notification | Whether conducted by independent external agency (Yes / No) | Results communicated in public domain (Yes / No) | Relevant <br> Web link |\n| :--: | :--: | :--: | :--: | :--: | :--: |\n| Promotion of Quality education- Mukundapuram and Magee Schools: | - | - | Yes | No | - |\n| MAFIL's investment in schools like MPS (Manappuram Public School) and MaGeet was based on the organization's commitment to providing quality education and fostering holistic development in the rural communities it serves. By allocating resources to educational initiatives, MAFIL aimed to address the critical need for accessible and high-quality rural schooling, particularly in regions like Valappad and Thrissur. Through MPS and Ma Geet, MAFIL aimed to facilitate the provision of comprehensive education that goes beyond academic excellence, thereby nurturing students' intellectual, emotional, and social growth. |  |  |  |  |  |\n| Promotion of Quality education- Skilling for students- MASKILL/MA IAM, Skilling projects: | - | - | Yes | No | - |\n| India, with its rapidly growing economy and a burgeoning youth population, stands at a critical juncture where skilling initiatives are imperative for sustainable development. The country's demography, characterized by a significant proportion of the working-age population, can be a boon if harnessed correctly. However, a large segment of this workforce remains unskilled or under-skilled, posing a challenge to economic growth and competitiveness. Skilling initiatives are essential to bridge this gap, equipping individuals with the necessary competencies to meet the demands of various industries, including technology, manufacturing, and services. By investing in skill development, India can enhance employability, reduce poverty, and ensure that its youth contribute effectively to the nation's economic progress. Recognizing the critical need for skill development, MAFIL has made significant investments in skilling within Valappad and the rural areas of Coimbatore and Palakkad through its Corporate Social Responsibility (CSR) initiatives. These investments include support for three major projects aimed at enhancing vocational skills and improving employment opportunities. One project, in collaboration with the Deen Dayal, Upadhyaya Grameen Kaushalya Yojana (DDU-GKY), focuses on skill development for rural youth, providing market-led training to improve employability. The MAIAM project was dedicated to automotive skilling, addressing the growing demand for skilled professionals in the automotive sector. MASKILL focused on nursing, training individuals to meet the critical need for healthcare professionals. |  |  |  |  |  |\n| Promotion of Quality Education - Student Coaching for Higher Education - CA/Entrance : | - | - | Yes | No | - |\n| Established in 2013, the Manappuram Academy of Professional Education (Ma Campus) is dedicated to providing coaching classes for CA-Foundation, CA-IPCC (Intermediate Course), CA-Final, and CMA courses. Currently, these courses are available at the Valappad and Thrissur Centers.Manappuram Academy for Entrance Coaching offers coaching for NEET, AIIMS, JIPMER, IIT, NIT, IIIT, and other prestigious exams. This coaching is designed for students aspiring to enter various professional courses in medical and engineering colleges, as well as other reputable institutes offering degrees in pure and applied sciences, such as IISc, IISER, NISER, and more. |  |  |  |  |  |\n\n2. Provide information on project(s) for which ongoing Rehabilitation and Resettlement (R\\&R) is being undertaken by your entity, in the following format:\nNot Applicable.", "metadata": {"source": "streamlit_temp_MANAPPURAM_22072024190041_BRSRBSE.pdf", "page": 32, "chunk_index": 0}}, {"text": "3. Describe the mechanisms to receive and redress grievances of the community.\n\nAt Manappuram Finance Limited, we prioritize the well-being and satisfaction of the community we serve. We have established effective mechanisms to receive and redress grievances from the community. The following channels are available for community members to report their complaints and grievances:\n\n1. Community members can directly approach our office locations to report their grievances. Our staff is trained to handle and address complaints promptly and efficiently.\n2. We have dedicated community outreach teams that actively engage with the local community and collect grievances from community members during their visits.\n3. We understand the importance of digital platforms in today's interconnected world. Community members can report complaints and grievances through our official social media channels. Our social media team actively monitors these platforms and ensures timely response and resolution.\n4. We have established customer relations teams that are specifically trained to handle and resolve customer grievances. Community members can reach out to these teams through designated contact points and expect a quick and satisfactory resolution.\n5. We provide a toll-free helpline number that is easily accessible to the community. Individuals can call this number to report their grievances, and our dedicated team members will address their concerns with utmost priority.\n\nWe are committed to addressing grievances in a fair, transparent, and timely manner. Each complaint or grievance received through these channels is thoroughly investigated, and appropriate actions are taken to redress the concerns raised. Manappuram Finance Limited values the trust and feedback of the community, and we strive to continuously improve our services based on their inputs.\n4. Job creation in smaller towns. Disclose wages paid to persons employed (including employees or workers employed on a permanent or non-permanent / on contract basis) in the following locations, as \\% of total wage cost:\n\n|  | FY-2024 <br> Current Financial Year | FY-2023 <br> Previous Financial Year |\n| :-- | :--: | :--: |\n| Rural | $\\mathbf{2 3 . 5 2 \\%}$ | $22.75 \\%$ |\n| Semi-urban | $\\mathbf{5 4 . 3 9 \\%}$ | $54.33 \\%$ |\n| Urban | $\\mathbf{1 4 . 4 7 \\%}$ | $\\mathbf{1 5 . 1 6 \\% \\%}$ |\n| Metropolitan | $\\mathbf{7 6 2 \\%}$ | $776 \\%$ |\n\n# Leadership Indicators \n\n2. Provide the following information on CSR projects undertaken by your entity in designated aspirational districts as identified by government bodies:\nNot Applicable.\n3. (a) Do you have a preferential procurement policy where you give preference to purchase from suppliers comprising marginalized/vulnerable groups? (Yes/No)\nNo. We do not have any preferential procurement policy for suppliers.\n4. (b) From which marginalized/vulnerable groups do you procure?\n\nNot Applicable.\n3. (c) What percentage of total procurement (by value) does it constitute?\n\nNot Applicable.\n4. Details of the benefits derived and shared from the intellectual properties owned or acquired by your entity (in the current financial year), based on traditional knowledge:\nNot Applicable.\n5. Details of corrective actions taken or underway, based on any adverse order in intellectual property related disputes wherein usage of traditional knowledge is involved.\nNot Applicable.", "metadata": {"source": "streamlit_temp_MANAPPURAM_22072024190041_BRSRBSE.pdf", "page": 33, "chunk_index": 0}}, {"text": "6. Details of beneficiaries of CSR Projects:\n\n| S. <br> No. | CSR Project | No. of persons benefitted from CSR Projects | \\% of beneficiaries from vulnerable and marginalized groups |\n| :--: | :--: | :--: | :--: |\n| 1 | Macare diagnostics | 107595 | 100\\% |\n| 2 | Ambulance service | 3075 | 33.8\\% |\n| 3 | Gym, badminton, Yoga, MAHIMA and swimming pool | 2500 | 100\\% |\n| 4 | Donations/for individuals having ailment etc./Others | 137 | 100\\% |\n| 5 | Mukundapuram and Mageet Schools | 1419 | 85\\% |\n| 6 | Skilling for students- MASkill/MA IAM/DDUGKY | 352 | 95\\% |\n| 7 | students coaching for higher education- CA/entrance (Macampus and Maacademy) | 796 | 85\\% |\n| 8 | Supporting various educational institutions and organizations, including Mobile for students etc. | - | - |\n| 9 | Community development programs/Housing projects support etc. | 29 | 100\\% |\n\n# PRINCIPLE 9 Businesses should engage with and provide value to their consumers in a responsible manner \n\n## Essential Indicators\n\n1. Describe the mechanisms in place to receive and respond to consumer complaints and feedback.\n\nAt Manappuram Finance Limited, we recognize that customers are the lifeblood of our business. Excellence in customer service is essential to our growth, especially in a competitive environment. Therefore, we have established a robust and effective redressal mechanism for addressing customer grievances.\n\nThe Customer Services Cell (CSC) at our Head Office serves as the central point for managing customer-related grievances. Our mechanism includes the following steps:\n\n1. Initial Reporting: The recipient of the complaint must inform the concerned Head of the Department at the Head Office about the nature and severity of the complaint. The Head of the Department will then immediately notify the CSC.\n2. Immediate Action: The recipient will take appropriate action to resolve the grievance. In serious cases, the CSC will also take immediate action to resolve the issue and will track its resolution.\n3. Tracking and Urgency: The CSC will track the resolution of the grievance. In critical cases, the Head of the CSC will notify the concerned Head of the Department by telephone to emphasize the urgency of the situation.\n\nGrievances are addressed immediately but no later than three working days from the date of receipt of the complaint.All unresolved complaints beyond 20 working days from the date of receipt at any office of the company will be escalated by the CSC through the Head of Operations to the CFO for immediate intervention.\n\nAdditional information is provided on our policy page under \"Mechanism for Dealing with Customer Complaints \\& Redressal\".\n2. Turnover of products and/ services as a percentage of turnover from all products/service that carry information about: Not Applicable.\n3. Number of consumer complaints in respect of the following:\n\n|  | FY-2024 Current Financial Year |  | Remarks | FY-2023 Previous Financial Year | Remarks |\n| :--: | :--: | :--: | :--: | :--: | :--: |\n|  | Received during the year | Pending resolution at end of year |  | Received during the year | Pending resolution at end of year |\n| Data privacy | 0 | 0 |  | 0 | 0 |\n| Advertising | 0 | 0 |  | 0 | 0 |\n| Cyber-security | 0 | 0 |  | 0 | 0 |\n| Delivery of essential services | 816 | 24 |  | 1290 | 50 |\n| Restrictive Trade Practices | 0 | 0 |  | 0 | 0 |\n| Unfair Trade Practices | 0 | 0 |  | 0 | 0 |\n| Other | 7231 | 31 |  | 4792 | 91 |", "metadata": {"source": "streamlit_temp_MANAPPURAM_22072024190041_BRSRBSE.pdf", "page": 34, "chunk_index": 0}}, {"text": "4. Details of instances of product recalls on account of safety issues:\n\nNot Applicable.\n5. Does the entity have a framework/ policy on cyber security and risks related to data privacy? (Yes/No) If available, provide a web-link of the policy.\nYes, Manappuram Finance Limited has a comprehensive Data Privacy Policy in place to address cybersecurity and risks related to data privacy. The policy is available on our website and can be accessed via the following link: https://www.manappuram. com/policies-codes.\n6. Provide details of any corrective actions taken or underway on issues relating to advertising, and delivery of essential services; cyber security and data privacy of customers; re-occurrence of instances of product recalls; penalty / action taken by regulatory authorities on safety of products / services.\nAt Manappuram Finance Limited, we take corrective actions seriously to address any issues relating to advertising, delivery of essential services, cybersecurity, data privacy and regulatory penalties. Our corrective measures include.\n\n1. Employee Training: Regular training programs are conducted to ensure employees are well-informed about compliance and best practices. Warnings and Retraining: In cases of non-compliance, warnings are issued and retraining is provided to the concerned employees to prevent future occurrences.\n2. Disciplinary Actions: For serious complaints or repeated offenses, we implement internal disciplinary actions which may include transfer, suspension, demotion, or other penalties as deemed appropriate.\n\nThese measures ensure that we maintain high standards of service delivery, protect customer data, and comply with all regulatory requirements.\n7. Provide the following information relating to data breaches\na. Number of instances of data breaches\n\nThere was no instance of data breaches in FY 2023-24.\nb. Percentage of data breaches involving personally identifiable information of customers\n\nNot Applicable.\nc. Impact, if any, of the data breaches\n\nNot Applicable.\n\n# Leadership Indicators \n\n1. Channels / platforms where information on products and services of the entity can be accessed (provide web link, if available). Currently, under the name of Manappuram Finance Limited, we are officially listed on various social media platforms such as Facebook, Instagram, LinkedIn, Twitter, YouTube, and Sharechat. We also have an official website. We regularly advertise our gold loan products through these channels.\n\nBelow are the URLs:\n\n- Facebook: https://www.facebook.com/ManappuramFinanceLimitedMAFIL\n- Instagram: https://www.instagram.com/manappuramofficial/?igsh=YXU30Gt0eHpuOW50\n- Twitter: https://x.com/ManappuramMAFIL\n- LinkedIn: https://www.linkedin.com/company/manappuram-finance-limited/\n- Website: https://www.manappuram.com/\n- Sharechat: https://sharechat.com/profile/manappuramfinance?d=n\n- YouTube: https://www.youtube.com/@ManappuramFinanceLimited", "metadata": {"source": "streamlit_temp_MANAPPURAM_22072024190041_BRSRBSE.pdf", "page": 35, "chunk_index": 0}}, {"text": "2. Steps taken to inform and educate consumers about safe and responsible usage of products and/or services.\n3. Mechanisms in place to inform consumers of any risk of disruption/discontinuation of essential services.\n\nAt Manappuram Finance Limited, we prioritize the education and awareness of our customers regarding the safe and responsible use of our products and services. Our initiatives include:\n\n1. Customer Consent Form: We collect consent forms from our customers, ensuring that they are informed about the products and services being offered.\n2. Product Information Updates: We regularly update our customers on the features of our products and the services we offer.\n3. Website and Social Media: We use our official website and social media posts to sensitize and educate customers about the safe and responsible usage of our products.\n4. Branch-Level Meetings: Monthly meetings are conducted at the branch level by regional managers. During these meetings, the following points are discussed: - Product information and features - Customer service-related issues Complaints, suggestions, and feedback from customers\n5. Product Details Display: Detailed information about our products is displayed prominently at all our branches.\n\nAt Manappuram Finance Limited, we have established robust mechanisms to ensure that our customers are promptly informed of any potential disruptions or discontinuations of essential services. We send SMS alerts to customers' registered mobile numbers to inform them of any disruptions. These messages provide timely updates regarding application issues and server downtime.\n4. Does the entity display product information on the product over and above what is mandated as per local laws? (Yes/No/Not Applicable) If yes, provide details in brief. Did your entity carry out any survey with regard to consumer satisfaction relating to the major products / services of the entity, significant locations of operation of the entity or the entity as a whole? (Yes/No) Yes. At Manappuram Finance Limited, we prioritize customer interests and financial education. We ensure that our product information goes beyond the mandates of local laws, aiming to be clear, easily understandable, and readily accessible to our customers. Our initiatives related to customer education and awareness the detailed in our response against Principle 9, Leadership Indicator\n\nYes, at Manappuram Finance Limited, we actively gather consumer feedback to gauge satisfaction levels across various aspects of our operations: - Feedback surveys are sent to customers via the mobile app immediately after applying for our products. - Feedback prompts are triggered at the time of repayment to capture customer insights. - QR codes are available at branch locations for customers to provide feedback directly. - Our call center is utilized for collecting additional feedback from customers. These measures help us continuously assess and improve our services to better meet customer expectations.", "metadata": {"source": "streamlit_temp_MANAPPURAM_22072024190041_BRSRBSE.pdf", "page": 36, "chunk_index": 0}}]